[
  {
    "title": "MyCoach",
    "tech": "React, Node",
    "imgUrl": [
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187522/Portfolio/MyCoach/hhbuaklfnkhsdrja99fn.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187522/Portfolio/MyCoach/k7p1qholonefx1flcfyx.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187522/Portfolio/MyCoach/euazqbrl53kmn9lmm59l.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187522/Portfolio/MyCoach/vlp33bhalmikrnknetsn.png"
    ],
    "description": "MyCoach est une plateforme française avant-gardiste conçue pour connecter les amateurs de fitness avec des coachs sportifs professionnels.\n\nVous êtes un coach sportif passionné, cherchant à étendre votre clientèle ? MyCoach vous offre une vitrine pour vous inscrire et proposer des programmes de fitness personnalisés. Votre portfolio, y compris vos plans d'entraînement spécialisés, sera mis en valeur sur votre profil, facilitant ainsi la découverte par des clients potentiels.\n\n Vous êtes amateur de fitness ? Lancez-vous dans un parcours de fitness transformateur avec MyCoach ! Explorez notre vaste liste de coachs enregistrés, découvrez leurs programmes d'entraînement personnalisés et achetez ceux qui correspondent à vos objectifs de fitness. Avec des paiements sécurisés par Stripe, MyCoach assure une expérience de transaction en toute sérénité.\n\n## **Fonctionnalités Clés :**\n\n**Création simple de programmes :** MyCoach propose un système de création de programmes personnalisés qui seront affichés directement sur votre boutique! \n\n**Sécurisation des programmes :** Les exercices des programmes proposés ne seront visibles qu'aux utilisateurs les ayant achetés au préalable. Une description des programmes sera ajoutée par les coachs pour aider les utilisateurs dans leurs besoins.\n\n3. **Affichage des programmes :** Notre application intègre un système de listing des programmes disponibles sur la plateforme. Ces derniers peuvent également être retrouvés directement sur le profil de vos coachs préférés (si vous en avez).\n\n4. **Mise en relation Coachs-Clients :** MyCoach vous permet d'entrer directement en contact avec les coachs qui ont développés les programmes que vous avez achetés. Permettant ainsi un suivi optimal pour la progression des usagers.\n\n5. **Gestion de Paiement Sécurisée :** Nous avons intégré le système de paiement Stripe pour une gestion sécurisée et pratique des transactions. Les utilisateurs peuvent effectuer leurs paiements en toute confiance, sachant que leurs informations sont protégées.\n\n6. **Communication Automatisée :** Grâce à l'intégration de Mailjet, notre application envoie automatiquement des e-mails pour confirmer les achats, fournir des informations importantes aux clients et aux coachs et garantir une communication fluide tout au long du processus.\n\n## **Infrastructure Technique :**\n\n**Base de Données :** PostgreSQL assure une gestion efficace et évolutive des données.\n\n**Langage de Programmation :** React a été choisi pour sa simplicité et son élégance.\n\n**Framework :** React - Vite a été utilisé pour accélérer le développement et maintenir une structure organisée.\n\nAvec **MyCoach**, que vous soyez un coach cherchant à agrandir votre clientèle ou un individu cherchant à révolutionner votre parcours de fitness, MyCoach est là pour soutenir et simplifier le processus."
  },
  {
    "title": "Hyper Progame",
    "tech": "React",
    "imgUrl": [
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186651/Portfolio/HyperProgame/sc1gseuew71zhzzdyjzp.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186651/Portfolio/HyperProgame/tz46dkpte1cnzrn9lmsx.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186651/Portfolio/HyperProgame/c7rz84uwt4zrafbouyfg.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186651/Portfolio/HyperProgame/chjbjwr4kloaq2rhvkga.png"
    ],
    "description": "**Explorez l'Univers des Jeux Vidéo** \n\n Hyper Progame est une plateforme dédiée aux jeux vidéo, offrant une expérience immersive pour les passionnés de jeux. Notre application est développée en utilisant la technologie JavaScript et exploitant Webpack pour une gestion optimale des ressources. Nous intégrons les API de RAWG et de YouTube v3 pour fournir des informations complètes et engageantes.\n\n## **Fonctionnalités Clés :** \n\n**Recherche de Jeux Vidéo :** Hyper Progame permet aux utilisateurs de rechercher des jeux vidéo par nom ou par plateforme (console, PC). Cela offre une navigation personnalisée pour trouver les jeux qui les intéressent.\n\n**Liste de Jeux sous Forme de Cartes :** Les jeux sont présentés sous forme de cartes, affichant les informations clés. En survolant avec la souris, des informations supplémentaires deviennent visibles, donnant aux utilisateurs un aperçu rapide.\n\n**Détails des Jeux :** En cliquant sur une carte de jeu, les utilisateurs accèdent à une page détaillée. Cette page affiche la date de sortie, l'éditeur, les plateformes disponibles, le genre et divers tags pour donner une vue complète du jeu.\n\n**Section d'Achat :** Une section \"ACHETER\" est disponible, fournissant des liens directs vers les boutiques où les utilisateurs peuvent se procurer le jeu.\n\n**Section Bande-Annonce :** La section \"BANDE-ANNONCE\" affiche une vidéo YouTube du trailer du jeu, offrant un aperçu dynamique de ce qui attend les joueurs.\n\n**Section Captures d'Écran :** Une section \"CAPTURES D'ÉCRAN\" présente plusieurs images du jeu, donnant aux utilisateurs un aperçu visuel de l'esthétique et du gameplay.\n\n## **Infrastructure Technique :**\n\n**Langage de Programmation :** Hyper Progame est développé en JavaScript pour sa flexibilité et sa compatibilité avec les navigateurs.\n\n**Gestion des Ressources :** Webpack est utilisé pour optimiser la gestion des ressources, améliorant les performances et la rapidité de l'application.\n\n**Intégration d'API :** Nous exploitons les API de RAWG et de YouTube v3 pour récupérer des informations détaillées sur les jeux ainsi que des bandes-annonces pertinentes.\n\nAvec **Hyper Progame**, nous créons une plateforme complète pour les amateurs de jeux vidéo, offrant des informations riches, une expérience visuelle captivante et un accès rapide aux éléments clés de chaque jeu. Plongez dans l'univers du jeu vidéo avec aisance et enthousiasme !"
  },
  {
    "title": "Kiddens",
    "tech": "Ruby on Rails",
    "imgUrl": [
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187095/Portfolio/Kiddens/r7mbia4sz1xx7yyc6rdw.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187095/Portfolio/Kiddens/cwqev0ohnmyw3ydrlupe.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187095/Portfolio/Kiddens/iesswempon9dppkllrhy.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701187095/Portfolio/Kiddens/mej6mkmxoeog6tqgsg3p.png"
    ],
    "description": "Kiddens est une boutique en ligne dédiée à l'univers des chats, offrant une expérience unique pour les amoureux de félins. Notre site propose une vaste sélection d'images de chats dans une interface conviviale et pratique conçue pour enchanter chaque visiteur.\n\n## **Fonctionnalités Clés :**\n\n**Exploration d'Images de Chats :** Kiddens présente une variété d'images de chats pour satisfaire les amateurs de tout âge. Notre collection soigneusement sélectionnée capture la beauté et la diversité de ces créatures fascinantes.\n\n**Authentification des Utilisateurs :** Pour une expérience personnalisée, nous offrons un système d'authentification permettant aux utilisateurs de créer des comptes, de se connecter et de gérer leurs préférences.\n\n**Panier d'Achat avec Total :** Les utilisateurs peuvent explorer notre gamme d'images de chats et les ajouter à leur panier d'achat. Le panier affiche le prix total de leurs achats en cours.\n\n**Gestion des Commandes et Historique :** Kiddens propose un système de gestion des commandes pour que les utilisateurs puissent suivre leurs achats passés. L'historique des commandes offre une vue complète de leurs expériences précédentes.\n\n**Paiements Sécurisés avec Stripe :** Nous avons intégré Stripe pour des transactions sécurisées et pratiques. Les utilisateurs peuvent effectuer leurs paiements en toute confiance, en sachant que leurs données sont protégées.\n\n**Dashboard Administrateur :** Notre dashboard admin offre un contrôle complet sur le site. Les administrateurs peuvent ajouter, modifier et supprimer des produits en vente. De plus, ils ont un aperçu global de toutes les commandes passées sur le site.\n\n**Smart URLs avec FriendlyID :** Grâce à FriendlyID, nous avons mis en place des URL conviviales et faciles à mémoriser pour chaque produit, améliorant ainsi l'expérience de navigation.\n\n**Communication Automatisée :** Mailjet est intégré pour envoyer des récapitulatifs de commande aux clients ainsi que des notifications aux administrateurs. Cela garantit une communication fluide tout au long du processus d'achat.\n\n## **Infrastructure Technique :**\n\n**Base de Données :** PostgreSQL assure une gestion efficace et évolutive des données.\n\n**Langage de Programmation :** Ruby a été choisi pour sa simplicité et son élégance.\n\n**Framework :** Ruby on Rails a été utilisé pour accélérer le développement et maintenir une structure organisée.\n\nAvec **Kiddens**, nous créons une expérience en ligne immersive pour les passionnés de chats, en offrant une sélection riche d'images et de fonctionnalités intuitives."
  },
  {
    "title": "CaraVan",
    "tech": "Ruby on Rails",
    "imgUrl": [
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186100/Portfolio/CaraVan/svadplh4qzv21m6lfkb5.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186100/Portfolio/CaraVan/e7fyinhiixhnlzmjlpqq.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186100/Portfolio/CaraVan/xtlins7jve876eltfuzj.png",
      "https://res.cloudinary.com/do3pr1kdp/image/upload/v1701186100/Portfolio/CaraVan/cx8k45dljkdhccexfran.png"
    ],
    "description": "CaraVan est une plateforme web française qui révolutionne la façon dont les gens vivent leurs aventures en van.\n\n Notre application offre une expérience de location de van simple et pratique, conçue pour optimiser chaque étape du voyage. \n\n ## **Fonctionnalités Clés :**\n\n**Location de Van Facilitée :** CaraVan propose une flotte de vans modernes, sécurisés et confortables pour répondre aux besoins de tous les voyageurs. Des couples aux familles en passant par les groupes d'amis, notre sélection de vans offre une variété de configurations pour une expérience personnalisée.\n\n**Options de Location entre Particuliers :** Nous croyons en la communauté et le partage. Les propriétaires de vans ont la possibilité de lister leurs véhicules sur notre plateforme, offrant ainsi aux autres passionnés de voyages la chance de vivre des aventures uniques. C'est une opportunité de monétiser leur van lorsque celui-ci est inutilisé.\n\n3. **Système de Réservation Intuitif :** Notre application intègre un système de réservation convivial basé sur les dates. Les utilisateurs peuvent facilement sélectionner les dates de leur voyage et réserver le van qui correspond le mieux à leurs besoins.\n\n4. **Filtrage des Annonces par Ville :** Pour une planification précise, les voyageurs peuvent filtrer les annonces de vans en fonction de leur destination. Cela garantit une expérience de voyage parfaitement adaptée à chaque itinéraire.\n\n5. **Gestion de Paiement Sécurisée :** Nous avons intégré le système de paiement Stripe pour une gestion sécurisée et pratique des transactions. Les utilisateurs peuvent effectuer leurs paiements en toute confiance, sachant que leurs informations sont protégées.\n\n6. **Communication Automatisée :** Grâce à l'intégration de Mailjet, notre application envoie automatiquement des e-mails pour confirmer les réservations, fournir des informations importantes aux voyageurs et garantir une communication fluide tout au long du processus.\n\n7. **Tests Rigoureux avec RSpec :** Notre équipe a mis en place une suite complète de tests fonctionnels avec RSpec. Cela garantit la fiabilité et la robustesse de l'application, offrant ainsi une expérience sans faille aux utilisateurs.\n\n## **Infrastructure Technique :**\n\n**Base de Données :** PostgreSQL pour une gestion efficace et évolutive des données.\n\n**Langage de Programmation :** Ruby pour sa simplicité et son élégance.\n\n**Framework :** Ruby on Rails pour accélérer le développement et maintenir une structure organisée.\n\nAvec **CaraVan**, nous transformons la location de vans en une expérience fluide et excitante, offrant aux voyageurs une plateforme complète pour explorer le monde avec confort et facilité."
  }
]